In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
        {'a' : [4,5,6,6,np.nan],
        'b' : [7,8,np.nan,9,9],
        'c' : [10,11,12,np.nan,12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',3),('e',4),('f',5)],
        names = ['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  NaN  12.0
  4  6.0  9.0   NaN
f 5  NaN  9.0  12.0

In [2]:
df.index

MultiIndex([('d', 1),
            ('d', 2),
            ('e', 3),
            ('e', 4),
            ('f', 5)],
           names=['n', 'v'])

In [3]:
df.head()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  NaN  12.0
  4  6.0  9.0   NaN
f 5  NaN  9.0  12.0

In [4]:
df[df['b'] != 7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  NaN  12.0
  4  6.0  9.0   NaN
f 5  NaN  9.0  12.0

In [5]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  3    False
   4    False
f  5    False
Name: a, dtype: bool

In [6]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 3  False   True  False
  4  False  False   True
f 5   True  False  False

In [7]:
df['a'].isnull().sum()

1

In [8]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 3   True  False   True
  4   True   True  False
f 5  False   True   True

In [9]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [10]:
df.a.notnull()

n  v
d  1     True
   2     True
e  3     True
   4     True
f  5    False
Name: a, dtype: bool

In [11]:
df[(df.b == 7) | (df.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [12]:
df.sample(frac=0.3)

       a    b     c
n v
e 3  6.0  NaN  12.0
f 5  NaN  9.0  12.0

In [13]:
df.sample(n=5)

       a    b     c
n v
e 3  6.0  NaN  12.0
  4  6.0  9.0   NaN
f 5  NaN  9.0  12.0
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0

In [14]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  NaN  12.0
  4  6.0  9.0   NaN
f 5  NaN  9.0  12.0

In [15]:
df.iloc[-2:]

       a    b     c
n v
e 4  6.0  9.0   NaN
f 5  NaN  9.0  12.0

In [16]:
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],
                'b': list('abdce'),
                'c': [1.0, 2.0, np.nan, 3.0, 4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [17]:
df.nlargest(1,'a')

    a  b    c
3  11  c  3.0

In [18]:
df.nsmallest(3,'a')

   a  b    c
4 -1  e  4.0
0  1  a  1.0
2  8  d  NaN

In [19]:
#모든값이 True일때만 True로 출력

df.all()

a    True
b    True
c    True
dtype: bool

In [20]:
# 하나라도 True이면 True로 출력
 
df.any()

a    True
b    True
c    True
dtype: bool

In [21]:
# 결측치여부를 True(결측치아님) False(결측치)로 구함

df.notnull()

      a     b      c
0  True  True   True
1  True  True   True
2  True  True  False
3  True  True   True
4  True  True   True

In [22]:
# 결측치가 하나라도있는 칼럼 찾음
# 하나라도 False가 있으면 False

df.notnull().all()

a     True
b     True
c    False
dtype: bool

In [23]:
df.notnull().any()

a    True
b    True
c    True
dtype: bool

In [24]:
#isnull로 결측치여부 확인, 하나라도있는 칼럼 찾기
# 하나라도 True일시 True
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False  False

In [25]:
df.isnull().any()

a    False
b    False
c     True
dtype: bool

* .all() : 한개라도 False가있으면 False 출력
* .any() : 한개라도 True가 있으면 True 출력

In [26]:
import pandas as pd
import seaborn as sns

In [27]:
df = sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [28]:
columns = ['sepal_width','sepal_length','species']
df[columns].head()

   sepal_width  sepal_length species
0          3.5           5.1  setosa
1          3.0           4.9  setosa
2          3.2           4.7  setosa
3          3.1           4.6  setosa
4          3.6           5.0  setosa

In [29]:
df['sepal_width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [30]:
# 칼럼명중 length로 끝나는 칼럼명 찾기

df.filter(regex = 'length$')

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [31]:
# sepal로 시작하는 칼럼명 표시

df.filter(regex = '^sepal')

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [32]:
df.filter(regex = '^(?!species$).*')

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [33]:
# ''안에 들어간 문자 제외. 칼럼명과 정확히 일치해야됨
df.filter(regex='^(?!petal$).*')

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [34]:
df.loc[2:5,'sepal_width' : 'petal_width']

   sepal_width  petal_length  petal_width
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

In [35]:
df.iloc[:3,[1]]

   sepal_width
0          3.5
1          3.0
2          3.2

In [36]:
df.loc[(df['sepal_length'] > 5) & (df['sepal_width'] < 4), ['sepal_length','sepal_width']].head()

    sepal_length  sepal_width
0            5.1          3.5
5            5.4          3.9
10           5.4          3.7
16           5.4          3.9
17           5.1          3.5

In [37]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [38]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [39]:
df['species'].value_counts()

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

In [40]:
len(df)

150

In [41]:
len(df) == df.shape[0]

True

In [42]:
df['species'].nunique()

3

In [43]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [44]:
df.all()

sepal_length    True
sepal_width     True
petal_length    True
petal_width     True
species         True
dtype: bool

In [45]:
df.describe(include=[np.object])

       species
count      150
unique       3
top     setosa
freq        50

In [46]:
df.describe(exclude=[np.object])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [47]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [48]:
df['petal_width'].sum()

179.90000000000003

In [49]:
df['petal_width'].count()

150

In [50]:
df.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [51]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [52]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [53]:
df.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [54]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [55]:
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [56]:
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [57]:
def smp(x):
    
    x = x[-3:]
    
    return x

In [58]:
df['species_3'] = df['species'].apply(lambda x : x[:3])
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [59]:
df['species-3'] = df['species'].apply(smp)

In [60]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

In [61]:
p = df['species']
p.apply(smp)

0      osa
1      osa
2      osa
3      osa
4      osa
      ...
145    ica
146    ica
147    ica
148    ica
149    ica
Name: species, Length: 150, dtype: object

In [62]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

* .all() : 모든값이 null값일시 처리
* .any() : 한개의 값이라도 null값일시 처리

In [68]:
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

In [73]:
df.dropna(axis=0, how='all')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [66]:
#null값 0으로 채우기

df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [74]:
values = {'A' : 0 , 'B' : 1, 'C':2, 'D':3}
df.fillna(value = values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [75]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [76]:
fill_na_value = df['D'].max()
fill_na_value

5

In [77]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [86]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [87]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64